Tekla.Structures.Drawing.AlongLineOrWithLeaderLinePlacingType
The AlongLineOrWithLeaderLinePlacingType class defines a placing type that
places the object using the along line placing as the first option.
If there is no room for the first option the fallback option will be used.
The fallback option is placing the object with a leader line.

Tekla.Structures.Drawing.AlongLineOrWithLeaderLinePlacingType.#ctor
Creates a new along line or with leader line placing type instance.